1s/ERP/Conf/Enums/Лико_ОбразцыЦвета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ОбразцыЦвета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОбразец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦветоПроба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОбразца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредыдущийТираж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаВОМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогПантонов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаВКнигеОбразцов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннийОбразец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтверждениеОбразцаПриПечати</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольныйОттиск</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ОбразцыЦвета/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ВнешнийОбразец);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ЦветоПроба);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.БезОбразца);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ПредыдущийТираж);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ЭтикеткаВОМ);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.КаталогПантонов);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ЭтикеткаВКнигеОбразцов);
	ДанныеВыбора = СЗ;

	
КонецПроцедуры
